Tekla.Structures.DialogInternal.ICDelegate


Tekla.Structures.DialogInternal.ICDelegate.ExportAddExternalWindow(System.String,System.IntPtr)
Adds an external window as TS child

Tekla.Structures.DialogInternal.ICDelegate.ExportRemoveExternalWindow(System.String,System.IntPtr)
Removes an external child from TS.

Tekla.Structures.DialogInternal.ICDelegate.ExportRegisterDialog(System.String)
Register a FormBase-based dialog to the object dialog tree
Name: The name the dialog
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportGetModelPath(System.String@)
Get path to the currently open model's directory
Path: The returned path
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportAddAttribute(Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t@)
Add an attribute for the current dialog
Attribute: The name and description of the attribute
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportStoreAppliedValues(System.String)
Copy current dialog values to applied values for the dialog
dialogName: The name the dialog
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportGetCB
The dialog Get button callback. Gets the values for the dialog from the currently selected part
and sets them as the "dialog values" in the object dialog tree
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportModifyCB
The dialog Modify button callback. Gets the "dialog values" from the object dialog tree and
sets them for the currently selected part.
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportFindAttributeFile(System.String,System.String@)
Find a saved dialog data file. Search in the model, project, firm and system folders in this order
pFileName: The name of the dialog data file
FullFilePath: The full path to the found file
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportSetActiveDialog(System.String)
Set active dialog by name
Name: The name of the dialog
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportSetDialogToggles(System.Int32)
Set the toggles for the current dialog's attributes on or off
ToggleValue: true (1) to enable toggles, false (0) to disable
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportSetDialogValue(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@)
Set a value to an attribute, by attribute name, in the current dialog
Name: The name of the attribute
Value: The value structure for the attribute
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportGetDialogValue(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@)
Get a value of an attribute, by attribute name, in the currently dialog
Name: The name of the attribute
Value: The value structure for the attribute
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportGetUnitDecimals(Tekla.Structures.Dialog.dotdiaUnitTypes_e)
Get the number of decimals for a specified unit.
UnitType: The unit type
Returns: The number of decimals for this unit

Tekla.Structures.DialogInternal.ICDelegate.ExportUnitOperation(Tekla.Structures.DialogInternal.dotUnitOperation_t@)


Tekla.Structures.DialogInternal.ICDelegate.ExportGetSettings(Tekla.Structures.DialogInternal.dotdiaSettings_t@)
Get the settings structure
Settings: The settings structure to fill
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportGetActiveDialog(System.String@)
Get the active dialog name. The active dialog has to be set with dotdiaSetDialog.
Name: The name of the dialog will be set here
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportGetAttributeFileName(System.String@)
Get the attribute file name for laoading to stack.
Name: The name of the file will be set here
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportAddAttributeToStack(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@)
Set a value to an attribute, by attribute name, in the current dialog to the stack
Name: The name of the attribute
Value: The value structure for the attribute
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportConvertFromCurrentUnits(Tekla.Structures.DialogInternal.dotdiaProfile_t@)
Converts the input profile string from current units (defined in Unit and decimals options).
Profile: Profile string to convert
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportConvertToCurrentUnits(Tekla.Structures.DialogInternal.dotdiaProfile_t@)
Converts the input profile string to current units (defined in Unit and decimals options).
Profile: Profile string to convert
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.DialogInternal.ICDelegate.ExportAddAkitForm(Tekla.Technology.Akit.IAkitForm@)
Adds application form to akit to be used for recording macros from application
akitForm:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.ExportRemoveAkitForm(Tekla.Technology.Akit.IAkitForm@)
Removes application form from akit
akitForm:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.ExportGetMainFrameHandle(System.Int32@)
Gets main frame handle from TS
Ptr:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.LoadAttributeFileNameToDialogAndApply(System.String,System.String)
Applies the attributes found from the attribute file to the specified Dialog.
pAttributeFileName:
pDialogName:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.LoadAttributeFileNameToDialogAndModify(System.String,System.String)
Loads the attributes found from the attribute file to the specified Dialog and modify current selected instance.
pAttributeFileName:
pDialogName:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.DisplayHtmlHelpTopic(System.String)
Launches the html help viewer with given topic.
pHelpTopic: Help topic.
Returns: True on success, false otherwise.

Tekla.Structures.DialogInternal.ICDelegate.RegisterObjectDialogAttributeCallback(Tekla.Structures.DialogInternal.RebarAttibuteCallback_t)
Register delegate to be called when attribute value is requested
attributeCB:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.RegisterShapeObjectDialogAttributeCallback(Tekla.Structures.DialogInternal.ShapeAttibuteCallback_t)
Register delegate to be called when shape attribute value is requested
attributeCB:
Returns:

Tekla.Structures.DialogInternal.ICDelegate.ProcessValueChangedEvent(System.IntPtr,System.String)
Takes over the values in the calling dialog
handle:
parameter:

Tekla.Structures.DialogInternal.ICDelegate.FreeDialogOwnerHandle(System.IntPtr@)
Delete the dialog owner object
handle:
Returns: